In [1]:
import pandas as pd

In [7]:
df = pd.DataFrame({"Name": ["Aman", "Saurav", "Karan", "Shubham", "Abhishek", None, "Sammer"],
               "Age": [22, 23, None, 22, 25, 24, 26] ,
                "Marks": [85, None, 88, 90, 56, 72, None],
                "Subject": ["Math", "Physics", "Math", "Chemistry", "Math", "Physics", "Chemistry"]})

In [8]:
df.shape

(7, 4)

In [ ]:
#display datatypes of each columns
df.dtypes

Name        object
Age        float64
Marks      float64
Subject     object
dtype: object

In [13]:
#generate summary statistics of the dataframe
df.describe()

             Age      Marks
count   6.000000   5.000000
mean   23.666667  78.200000
std     1.632993  14.254824
min    22.000000  56.000000
25%    22.250000  72.000000
50%    23.500000  85.000000
75%    24.750000  88.000000
max    26.000000  90.000000

In [14]:
#Filter and group the data
#Create a view showing only the 'Name' and 'Marks' columns
df[["Name", "Marks"]]

       Name  Marks
0      Aman   85.0
1    Saurav    NaN
2     Karan   88.0
3   Shubham   90.0
4  Abhishek   56.0
5      None   72.0
6    Sammer    NaN

In [16]:
#Filtering : Select rows where 'Marks' is greater than 80
df[df["Marks"] > 80]

      Name   Age  Marks    Subject
0     Aman  22.0   85.0       Math
2    Karan   NaN   88.0       Math
3  Shubham  22.0   90.0  Chemistry

In [17]:
# Complex filtering : Select students older than 22 who scored more than 80 in 'Math'
df[(df["Age"] > 22) & (df["Marks"] > 80) & (df["Subject"] == "Math")]

Empty DataFrame
Columns: [Name, Age, Marks, Subject]
Index: []

In [20]:
#Aggregation : count how many students are enrolled in each subject
df.groupby("Subject").size()

Subject
Chemistry    2
Math         3
Physics      2
dtype: int64

In [21]:
#Task : Order the data to find rankers

#Sort the dataframe by 'Marks' in descending order
df.sort_values(by="Marks", ascending=False)

       Name   Age  Marks    Subject
3   Shubham  22.0   90.0  Chemistry
2     Karan   NaN   88.0       Math
0      Aman  22.0   85.0       Math
5      None  24.0   72.0    Physics
4  Abhishek  25.0   56.0       Math
1    Saurav  23.0    NaN    Physics
6    Sammer  26.0    NaN  Chemistry

In [22]:
#Use a specific Pandas function to find the top 2 students based on their marks without sorting the entire dataframe manually
df.nlargest(2, "Marks")

      Name   Age  Marks    Subject
3  Shubham  22.0   90.0  Chemistry
2    Karan   NaN   88.0       Math

In [23]:
#Identify the student with the lowest marks(Remedial Candidate)
df.loc[df["Marks"].idxmin()]

Name       Abhishek
Age            25.0
Marks          56.0
Subject        Math
Name: 4, dtype: object

In [24]:
#Handle missing values : Fill missing 'Marks' with the average marks

# Calculate the total number of the missing values in the each column
df.isnull().sum()

Name       1
Age        1
Marks      2
Subject    0
dtype: int64

In [25]:
#Filter and display rows where 'Marks' are missing
df[df['Marks'].isnull()]

     Name   Age  Marks    Subject
1  Saurav  23.0    NaN    Physics
6  Sammer  26.0    NaN  Chemistry

In [26]:
# Create a new dataFrame alled cleaned_df by removing any row that conatains even a single missing value
cleaned_df = df.dropna()

In [28]:
# Compare the shape of cleaned_df vs  orifinal df
print("Original DataFrame shape:", df.shape)
print("Cleaned DataFrame shape:", cleaned_df.shape)

Original DataFrame shape: (7, 4)
Cleaned DataFrame shape: (3, 4)

In [29]:
#Analyze the logic :

# Technical Q : Look at the 'Marks' colum in your output. why are the values floats(85.0) instead of integers ?

In [30]:
#Technical Q: What is the risk of using inplace=True when dropping missing values ?

In [31]:
# Bussiness Q : Based on the data , what specific feedback should you given to the adin team regarding the "Name" column ?

In [32]:
# what is the average marks per subject
df.groupby("Subject")["Marks"].mean()

Subject
Chemistry    90.000000
Math         76.333333
Physics      72.000000
Name: Marks, dtype: float64

In [33]:
# what is the average marks per subject without groupby
df["Marks"].mean()

np.float64(78.2)

In [ ]:
#why we use groupby?